app/controllers/movies_controller.rb

SELECT rating FROM "movies" GROUP BY rating
SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    @sort = params[:sort]  # will get title or date value
    @all_ratings = Movie.select(:rating).group(:rating).map(&:rating)
    @movies = Movie.order(@sort)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @movie = Movie.find params[:id]